TestEDT/src/InformationRegisters/уа_Котировки/уа_Котировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уа_Котировки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>DefinedType.уа_Цена</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидКотировки</name>
    <type>
      <types>EnumRef.уа_ВидыКотировки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Биржа</name>
    <type>
      <types>CatalogRef.уа_Биржи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦеннаяБумага</name>
    <type>
      <types>CatalogRef.уа_ФинансовыеИнструменты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestEDT/src/InformationRegisters/уа_Котировки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура Обновить(Котировка) Экспорт 
	КотировкаОтбор = Новый Структура("ВидКотировки,Биржа,ЦеннаяБумага,Валюта");
	ЗаполнитьЗначенияСвойств(КотировкаОтбор, Котировка); 
	Структура = РегистрыСведений.уа_Котировки.ПолучитьПоследнее(Котировка.Период, КотировкаОтбор);
	Если Структура.Значение <> Котировка.Значение Тогда
		МенеджерЗаписи = РегистрыСведений.уа_Котировки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Котировка);
		МенеджерЗаписи.Записать(Истина);		
	КонецЕсли;                     	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
